In [2]:
import pandas as pd
df=pd.read_csv("student.csv")
df

   Reg.no    M1    M2    M3  Result
0     100  85.0  78.0  92.0       1
1     101  56.0   NaN  60.0       0
2     102   NaN  85.0  80.0       1
3     103  90.0  88.0  94.0       1
4     104  45.0  55.0  50.0       0
5     105  63.0  72.0   NaN       1

In [3]:
df.describe()

           Reg.no         M1         M2         M3    Result
count    6.000000   5.000000   5.000000   5.000000  6.000000
mean   102.500000  67.800000  75.600000  75.200000  0.666667
std      1.870829  19.175505  13.088163  19.524344  0.516398
min    100.000000  45.000000  55.000000  50.000000  0.000000
25%    101.250000  56.000000  72.000000  60.000000  0.250000
50%    102.500000  63.000000  78.000000  80.000000  1.000000
75%    103.750000  85.000000  85.000000  92.000000  1.000000
max    105.000000  90.000000  88.000000  94.000000  1.000000

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Reg.no  6 non-null      int64
 1   M1      5 non-null      float64
 2   M2      5 non-null      float64
 3   M3      5 non-null      float64
 4   Result  6 non-null      int64
dtypes: float64(3), int64(2)
memory usage: 368.0 bytes

In [5]:
df.isnull().sum()

Reg.no    0
M1        1
M2        1
M3        1
Result    0
dtype: int64

In [6]:
df.dtypes

Reg.no      int64
M1        float64
M2        float64
M3        float64
Result      int64
dtype: object

In [7]:
df.shape

(6, 5)

In [13]:
df1=df.fillna("0")
df1

   Reg.no    M1    M2    M3  Result
0     100  85.0  78.0  92.0       1
1     101  56.0     0  60.0       0
2     102     0  85.0  80.0       1
3     103  90.0  88.0  94.0       1
4     104  45.0  55.0  50.0       0
5     105  63.0  72.0     0       1

In [14]:
df2=df.fillna("5")
df2

   Reg.no    M1    M2    M3  Result
0     100  85.0  78.0  92.0       1
1     101  56.0     5  60.0       0
2     102     5  85.0  80.0       1
3     103  90.0  88.0  94.0       1
4     104  45.0  55.0  50.0       0
5     105  63.0  72.0     5       1

In [15]:
df1=df.fillna({'chol':1,'fbs':2})

In [16]:
df1 = df.ffill()
df1

   Reg.no    M1    M2    M3  Result
0     100  85.0  78.0  92.0       1
1     101  56.0  78.0  60.0       0
2     102  56.0  85.0  80.0       1
3     103  90.0  88.0  94.0       1
4     104  45.0  55.0  50.0       0
5     105  63.0  72.0  50.0       1

In [17]:
df1 = df.bfill()
df1

   Reg.no    M1    M2    M3  Result
0     100  85.0  78.0  92.0       1
1     101  56.0  85.0  60.0       0
2     102  90.0  85.0  80.0       1
3     103  90.0  88.0  94.0       1
4     104  45.0  55.0  50.0       0
5     105  63.0  72.0   NaN       1

In [18]:
df1 = df.interpolate()
df1

   Reg.no    M1    M2    M3  Result
0     100  85.0  78.0  92.0       1
1     101  56.0  81.5  60.0       0
2     102  73.0  85.0  80.0       1
3     103  90.0  88.0  94.0       1
4     104  45.0  55.0  50.0       0
5     105  63.0  72.0  50.0       1

In [19]:
df1 = df.dropna()
df1

   Reg.no    M1    M2    M3  Result
0     100  85.0  78.0  92.0       1
3     103  90.0  88.0  94.0       1
4     104  45.0  55.0  50.0       0